{"1": ["Who holds all sovereign power in Kenya according to this Constitution?", "How can the people of Kenya exercise their sovereign power?", "To which state organs is sovereign power delegated?", "At which levels is the sovereign power of the people exercised in Kenya?"], "2": ["What makes this Constitution the ultimate authority in Kenya?", "Who can claim or exercise state power and under what conditions?", "Can the Constitution's validity be challenged in any way?", "What happens to laws that contradict this Constitution?", "How do international treaties and conventions become part of Kenyan law?"], "3": ["What is the obligation of every individual towards this Constitution?", "What makes an attempt to form a government unlawful?", "How should a government be established according to this Constitution?", "What is the primary duty of citizens regarding this Constitution?", "What action is prohibited in establishing a government?"], "4": ["What is the form of government Kenya has?", "What are the founding principles of Kenya's democracy?", "Is Kenya a multi-party state?", "What is the basis of Kenya's governance?", "What is the political structure of Kenya according to the constitution?"], "5": ["What is the initial extent of Kenya's territory and waters?", "How can Kenya's territory and waters be expanded?", "Who has the power to define additional territory and waters for Kenya?", "What is the legal basis for any future expansion of Kenya's territory and waters?", "What happens to Kenya's territory and waters if an Act of Parliament is passed to define additional territory?"], "6": ["How many counties are Kenya divided into?", "How should national and county governments interact?", "Which state organs must ensure equal access to services?", "What factors determine reasonable access to services?", "What services should be accessible in all parts of Kenya?"], "7": ["What is the primary language of Kenya?", "What are the official languages of Kenya?", "What are the state's responsibilities regarding language diversity?", "What specific languages and communication methods should the state promote and protect?", "How should the state support accessibility for persons with disabilities in terms of language and communication?"], "8": ["Is there a state religion in Kenya?", "How does the constitution ensure religious freedom?", "What is the role of religion in the governance of Kenya?", "Are all religions treated equally by the state?", "Does the state provide any support to religious institutions?"], "9": ["What are the national symbols of Kenya?", "How are the national symbols defined?", "What are the national days of Kenya?", "When are these national days observed?", "Can Parliament create additional public holidays?"], "10": ["Who is bound by the national values and principles of governance outlined in this Article?", "What are the specific values and principles mentioned in this Article?", "When and how do these values and principles apply?", "What is the purpose of including these values and principles in the Constitution?", "How do these values and principles ensure good governance and accountability?"], "11": ["What does the Constitution recognize as the foundation of Kenya?", "What are the ways the State promotes national and cultural expression?", "How does the State acknowledge the role of science and indigenous technologies in Kenya's development?", "What intellectual property rights does the State promote for Kenyans?", "What kind of legislation should Parliament enact to compensate communities for the use of their cultures and cultural heritage?"], "12": ["What rights and benefits does every Kenyan citizen have?", "What documents can a Kenyan citizen expect to receive from the state?", "Under what conditions can a Kenyan passport or document be denied, suspended, or confiscated?", "What kind of law is required to regulate these actions on passports or documents?", "What constitutional article must this law satisfy?"], "13": ["How does one retain their citizenship status after the effective date of the constitution?", "What are the two primary ways to acquire Kenyan citizenship?", "Does marriage or divorce affect one's Kenyan citizenship status?"], "14": ["Under what circumstances can a person be a Kenyan citizen by birth?", "Does this apply to those born before the constitution's enactment?", "Can Parliament limit citizenship for those born outside Kenya to Kenyan parents?", "What happens to a child found in Kenya with unknown nationality and parents?", "Can a former Kenyan citizen regain citizenship if they acquired another country's citizenship?"], "15": ["How long must one be married to a Kenyan citizen to apply for citizenship by registration?", "What is the required continuous residence period in Kenya for non-citizens to apply for registration?", "What is the process for a non-citizen child adopted by a Kenyan citizen to gain citizenship?", "What conditions must Parliament set for granting citizenship to foreign nationals?", "When does this Article's provisions take effect for applicants?"], "16": ["Can a Kenyan citizen retain their citizenship after acquiring another country's citizenship?", "Does the Kenyan constitution allow for dual citizenship?", "How does the constitution handle citizenship when a Kenyan also holds another country's passport?", "Can a person lose their Kenyan citizenship by becoming a citizen of another country?", "Does the constitution recognize dual citizenship for Kenyans?"], "17": ["Under what circumstances can citizenship acquired by registration be revoked?", "What are the penalties for certain offenses that could lead to citizenship revocation?", "When can citizenship presumed by birth be revoked?", "What role does fraud play in revoking citizenship in both cases?", "What additional factors can lead to revocation of citizenship presumed by birth?"], "18": ["How does one become a Kenyan citizen?", "What are the rules for entering and staying in Kenya?", "What is the status of permanent residents?", "How can one voluntarily give up their Kenyan citizenship?", "What are the duties and rights of Kenyan citizens?"], "19": ["What is the role of the Bill of Rights in Kenya's democratic state?", "What is the purpose of recognizing and protecting human rights and fundamental freedoms?", "Who do the rights and fundamental freedoms in the Bill of Rights belong to?", "What is the relationship between the rights in the Bill of Rights and other rights recognized or conferred by law?", "What are the limitations on the rights and fundamental freedoms in the Bill of Rights?"], "20": ["Who does the Bill of Rights apply to and bind?", "How should rights and fundamental freedoms be enjoyed?", "What should a court do when applying a provision of the Bill of Rights?", "What values and principles should be promoted when interpreting the Bill of Rights?", "What principles guide a court when the State claims lack of resources to implement a right?"], "21": ["What is the fundamental duty of the State and its organs regarding the Bill of Rights?", "How should the State ensure the progressive realisation of rights guaranteed under Article 43?", "What is the duty of State organs and public officers towards vulnerable groups?", "What kind of legislation should the State enact to fulfil its international human rights obligations?", "How should the State address the needs of specific vulnerable groups within society?"], "22": ["Who can initiate court proceedings to protect rights under the Bill of Rights?", "What are the rules for court proceedings regarding the Bill of Rights?", "What are the criteria for these rules?", "What happens if these rules are not in place?", "Who can appear as a 'friend of the court' in these proceedings?"], "23": ["Which courts have the power to address violations of rights outlined in the Bill of Rights?", "Can lower courts also handle such cases, and if so, how is this established?", "What types of remedies can a court provide in cases involving rights violations?", "What happens if a law is found to infringe upon these rights?", "In what ways can the judiciary review and address these issues?"], "24": ["Under what conditions can a right or fundamental freedom in the Bill of Rights be limited?", "What factors must be considered when limiting a right or fundamental freedom?", "What is required of the State or a person seeking to justify a limitation of a right?", "How are the equality provisions qualified for Muslim law before Kadhis’ courts?", "Which rights can be limited for persons serving in the Kenya Defence Forces or the National Police Service?"], "25": ["What rights and freedoms are explicitly protected from limitation by the Kenyan Constitution?", "Which specific treatments are prohibited by the Constitution, even in exceptional circumstances?", "What is the guarantee regarding the process of law enforcement and justice?", "What is the right that ensures individuals are not held in detention indefinitely without cause?", "Which fundamental freedoms are considered non-negotiable, even in the face of other constitutional provisions?"], "26": ["When does the right to life begin according to this article?", "Under what conditions is abortion permitted?", "When can a person's life be intentionally deprived?", "What are the exceptions to the right to life?", "Who determines the need for abortion in emergency cases?"], "27": ["What does the constitution guarantee regarding equality before the law?", "How does the constitution define equality in terms of rights and freedoms?", "What specific rights to equal treatment does the constitution grant to women and men?", "What are the grounds on which the state and individuals cannot discriminate against others?", "What measures does the state take to address past discrimination and ensure gender balance in elective and appointive bodies?"], "28": ["What fundamental right does every person inherently possess according to this article?", "How should this right be treated by others?", "What is the responsibility of society towards an individual's dignity?", "What does this article ensure every person has?", "What is the expected behavior towards others' dignity as per this article?"], "29": ["Under what circumstances can a person be deprived of freedom?", "When can a person be detained without trial?", "What protections does the constitution provide against violence from both public and private sources?", "What forms of punishment are prohibited by the constitution?", "What kind of treatment is considered cruel, inhuman, or degrading?"], "30": ["What kind of work can't a person be forced to do?", "What is prohibited by the phrase 'held in slavery or servitude'?", "What are the two main prohibitions regarding a person's labor as per this article?", "What rights does this article grant regarding a person's labor?", "What is the punishment for requiring someone to perform forced labor?"], "31": ["What rights does the constitution grant regarding personal privacy?", "When can my home or property be searched?", "Under what circumstances can my possessions be seized?", "When can information about my family or private affairs be revealed?", "What protections does the constitution offer for my communication privacy?"], "32": ["What fundamental freedoms does Article 32 protect?", "Can individuals practice their religion in private or public?", "Can institutions or employers discriminate based on someone's belief or religion?", "Can a person be forced to act against their beliefs?", "What rights are guaranteed to individuals in Article 32?"], "33": ["What are the different aspects of freedom of expression outlined in this article?", "What are the limits to the right of freedom of expression as per this article?", "What are the grounds on which freedom of expression may be restricted?", "What is the responsibility of individuals while exercising their right to freedom of expression?", "What specific acts are not protected under the right to freedom of expression?"], "34": ["What freedoms does the constitution guarantee to the media?", "What are the limitations on state control over the media?", "What conditions apply to the freedom of establishment for broadcasting and other electronic media?", "What are the requirements for State-owned media?", "What kind of regulatory body will Parliament establish for the media?"], "35": ["What information can every citizen access from the state?", "What kind of information can a citizen access from another person?", "What right does every person have regarding incorrect or misleading information about them?", "What is the state's responsibility in regards to sharing important national information?", "What specific rights are protected by the access to information article?"], "36": ["What rights does every person have regarding freedom of association?", "Can a person be forced to join an association?", "What conditions must legislation meet when requiring registration of an association?", "What should happen if registration is to be cancelled?", "What is the process for registering an association?"], "37": ["What freedoms does Article 37 guarantee for every person?", "Can these freedoms be exercised peacefully and without arms?", "What specific actions does Article 37 allow individuals to engage in?", "Who can these actions be directed towards?", "What is the purpose of these actions according to Article 37?"], "38": ["What political choices are Kenyan citizens free to make?", "What are the key elements of free and fair elections in Kenya?", "What voting rights does every adult Kenyan citizen have?", "What restrictions, if any, can be placed on voter registration and voting?", "What political offices can Kenyan citizens run for and hold?"], "39": ["What freedom does every person have regarding movement within Kenya?", "What right does every person have regarding leaving Kenya?", "What rights do Kenyan citizens have regarding entering, staying, and living anywhere in Kenya?", "Does this article guarantee the right to return to Kenya for its citizens?", "Are there any restrictions on these rights mentioned in this article?"], "40": ["What types of property can a person acquire and own in Kenya?", "Under what conditions can the State deprive a person of property?", "What is the requirement for compensation when property is acquired for a public purpose?", "Who is eligible for compensation when land is acquired under clause (3)?", "What kind of property rights does the State support and protect?"], "41": ["What rights does every worker have regarding fair remuneration and working conditions?", "Can workers form or join trade unions and go on strike?", "What rights do employers have in relation to trade unions and employers' organisations?", "What rights do trade unions and employers' organisations have regarding their administration and activities?", "What is the right of trade unions, employers' organisations, and employers regarding collective bargaining?"], "42": ["What are the two key rights guaranteed to every person regarding the environment?", "Who is responsible for protecting the environment for present and future generations?", "What specific measures are mentioned for environmental protection?", "What obligations are to be fulfilled regarding the environment?", "What article is mentioned for the fulfillment of environmental obligations?"], "43": ["What fundamental rights does the constitution grant regarding health care?", "How is the right to adequate housing defined in the constitution?", "What does the constitution state about the right to food and water?", "What is the provision for emergency medical treatment?", "Who is entitled to social security according to the constitution?"], "44": ["What rights does every person have regarding language and culture?", "What are the specific rights of a person belonging to a cultural or linguistic community?", "What are the two ways a person can enjoy their culture and use their language?", "What are the two ways a person can participate in cultural and linguistic associations?", "What is prohibited regarding cultural practices or rites?"], "45": ["What is the fundamental unit of society according to the constitution?", "Who has the right to marry and on what basis?", "What rights are parties to a marriage entitled to?", "What kind of marriages should Parliament recognize?", "What systems of personal and family law should be recognized by Parliament?"], "46": ["What rights do consumers have regarding the quality of goods and services?", "What kind of information should consumers have access to for goods and services?", "What protections does the constitution provide for consumer health, safety, and economic interests?", "What compensation can consumers expect for losses from defective goods or services?", "What entities are bound by the consumer rights outlined in this article?"], "47": ["What rights does every person have regarding administrative action?", "When can a person demand written reasons for administrative action?", "What should Parliament legislate to ensure these rights?", "What kind of review process should be established by this legislation?", "What should the legislation aim to promote besides these rights?"], "48": ["What does the State guarantee regarding access to justice for all?", "When a fee is required for justice, what does the Constitution ensure about its reasonableness?", "How does the Constitution prevent fees from impeding access to justice?", "What is the State's responsibility in ensuring justice is accessible to all?", "What does the Constitution say about the affordability of justice in Kenya?"], "49": ["What information must be promptly provided to an arrested person?", "What is the maximum time an arrested person can be held before appearing in court?", "Who can an arrested person communicate with?", "What cannot be compelled from an arrested person?", "Under what conditions can an arrested person be released on bond or bail?"], "50": ["What rights does an accused person have during a trial according to the Kenyan Constitution?", "How is the right to a fair trial ensured in Kenya?", "What are the exceptions to the public nature of trials in Kenya?", "What happens if new evidence emerges after a criminal conviction?", "What protection does the Kenyan Constitution provide for victims of offences?"], "51": ["What rights does a person retain while detained, held in custody, or imprisoned?", "Can a detained or held person seek a habeas corpus order?", "What kind of legislation should Parliament enact for detainees, focusing on their treatment?", "How should this legislation consider international human rights instruments?", "What are the exceptions to the rights retained by a person in detention?"], "52": ["What groups of persons does this Part specifically apply to?", "How does this Part ensure greater certainty in the application of rights?", "Does this Part limit or qualify any rights in any way?", "What is the purpose of this Part in relation to the Bill of Rights?", "What is the scope of this Part in terms of the rights it elaborates on?"], "53": ["What rights does every child have regarding their identity and origin?", "What educational rights are guaranteed to every child?", "What basic needs are children entitled to according to the constitution?", "What forms of harm and exploitation are children protected from?", "Under what conditions can a child be detained, and how should they be treated while detained?"], "54": ["What rights does a person with a disability have regarding their treatment and communication?", "How should educational institutions cater to individuals with disabilities?", "What accessibility measures should be in place for people with disabilities in public spaces and transport?", "What communication methods should be accommodated for people with disabilities?", "What is the state's responsibility in ensuring representation of people with disabilities in elective and appointive bodies?"], "55": ["What steps must the state take to ensure youth access education and training?", "How should the state facilitate youth participation in various aspects of life?", "What are the state's responsibilities in providing youth with employment opportunities?", "What measures should the state implement to safeguard youth from harmful cultural practices?", "In what ways should the state protect youth from exploitation?"], "56": ["How does the constitution ensure minorities' and marginalised groups' participation in governance?", "What special opportunities does the constitution provide for these groups in education and economy?", "How does it facilitate their access to employment?", "What measures does it take to preserve their cultural values and languages?", "What provisions are there for their access to essential services like water and health?"], "57": ["What rights does the constitution grant to older persons to actively engage in society's affairs?", "How does the constitution ensure older persons' personal growth?", "What protections does it provide for their dignity and freedom from abuse?", "What assistance is the state obligated to provide for the elderly?", "What role does the family play in caring for older persons, according to the constitution?"], "58": ["Under what circumstances can a state of emergency be declared?", "How long can a state of emergency last without extension?", "What is the process for extending a state of emergency?", "What is the role of the Supreme Court in a state of emergency?", "What restrictions can legislation enacted during a state of emergency place on rights and freedoms?"], "59": ["What is the primary function of the Kenya National Human Rights and Equality Commission?", "How does the Commission promote gender equality?", "What kind of abuses can the Commission investigate?", "Who can file a complaint with the Commission?", "What happens if Parliament restructures the Commission?"], "60": ["What are the key principles guiding land policy in Kenya according to this article?", "How should land rights be secured according to this article?", "What is the role of communities in resolving land disputes, as per this article?", "What aspects of land management does this article emphasize for sustainability and productivity?", "How does this article suggest addressing gender discrimination in land and property law and practices?"], "61": ["Who owns all the land in Kenya according to this article?", "How is land in Kenya categorized?", "What are the three types of land classification mentioned in this article?", "Does this article recognize individual ownership of land?", "What is the collective ownership status of land in Kenya as per this article?"], "62": ["What is the definition of public land according to this article?", "How is public land classified?", "Who holds and administers public land classified under clauses (1)(a), (c), (d), or (e)?", "Who holds and administers public land classified under clauses (1)(f) to (m)?", "Under what conditions can public land be disposed of or used?"], "63": ["How does community land vest and who holds it?", "What are the different types of community land?", "How is unregistered community land managed?", "What are the restrictions on disposing or using community land?", "What legislative action is required to implement this article?"], "64": ["What types of land ownership are considered private land according to the Kenyan Constitution?", "How is registered land defined in the context of private land?", "What is the tenure for registered land under private land?", "What other forms of land can be declared private land?", "What is the legal process for declaring land as private under the Kenyan Constitution?"], "65": ["What type of land tenure is allowed for non-citizens?", "What is the maximum duration for such leases?", "How is a body corporate's citizenship determined for landholding purposes?", "How is property held in trust treated in terms of citizenship for landholding?", "What additional provisions can Parliament make regarding this Article?"], "66": ["How can the state control land use and property rights?", "What are the reasons the state may regulate land use?", "What role does Parliament play in ensuring property investments benefit local communities?", "What kind of legislation should Parliament enact regarding property investments?", "What are the expected outcomes of the legislation Parliament should enact on property investments?"], "67": ["What is the name of the commission established in this article?", "What are the primary functions of the National Land Commission?", "What kind of disputes does the commission encourage to be resolved traditionally?", "What does the commission assess and monitor, as per this article?", "What additional functions can the National Land Commission perform, according to this article?"], "68": ["What laws should Parliament revise and consolidate regarding land?", "How will Parliament regulate land use laws according to Article 60(1)?", "What are the minimum and maximum land holding acreages Parliament should prescribe for private land?", "How will Parliament protect and provide access to public land?", "What review process should Parliament establish for grants or dispositions of public land?"], "69": ["What are the key obligations of the state regarding the environment and natural resources?", "What is the target tree cover percentage for Kenya?", "How does the constitution protect intellectual property and indigenous knowledge related to biodiversity and genetic resources?", "What role does the public play in managing and protecting the environment according to the constitution?", "What measures does the constitution require to assess and monitor the environment?"], "70": ["What legal recourse does a person have if their right to a clean and healthy environment is being threatened?", "What kind of orders can a court issue to protect the environment in such cases?", "Can a court order public officers to take action to prevent environmental harm?", "Is it necessary to prove loss or injury to file an environmental rights complaint?", "What can a court do to compensate victims of environmental rights violations?"], "71": ["What transactions involving natural resources require Parliament's ratification?", "When does Parliament need to ratify such transactions?", "What types of transactions does Parliament need to legislate for ratification?", "What is the purpose of Parliament enacting legislation for these transactions?", "What is the timeline for Parliament's involvement in these transactions?"], "72": ["What kind of legislation should Parliament enact to fully implement this Part of the Constitution?", "What specific environmental provisions should this legislation address?", "How should Parliament ensure this legislation gives full effect to all environmental provisions in this Part?", "What are the key environmental areas Parliament should focus on in this legislation?", "What is the ultimate goal of the legislation Parliament should enact based on this Part?"], "73": ["What is the primary purpose of authority given to a State officer according to the Constitution?", "How should a State officer's decisions be influenced, according to the Constitution?", "What qualities are important for selecting or electing a leader, as per the guiding principles of leadership and integrity?", "What are the key aspects of selfless service expected from a leader, according to the Constitution?", "How is a leader accountable to the public, as per the guiding principles of leadership and integrity?"], "74": ["What is the required action before assuming a State office?", "What should be done while acting in a State office?", "What is necessary when performing any functions of a State office?", "What is the prescribed manner and form for the oath or affirmation of office?", "What are the sources for the manner and form of the oath or affirmation of office?"], "75": ["What behaviors should a State officer avoid in both public and private life?", "What happens if a State officer compromises public interest for personal gain?", "What are the consequences for a State officer who acts against the integrity of their office?", "What disciplinary actions can be taken against a State officer who violates these conduct rules?", "What is the consequence for a State officer who is dismissed for such violations?"], "76": ["What happens to gifts given to state officers on official occasions?", "When can a state officer maintain a bank account outside Kenya?", "In what circumstances should a state officer not seek or accept a personal loan or benefit?", "What makes a state officer's integrity compromised in accepting a personal loan or benefit?", "What is the consequence if a state officer maintains a bank account outside Kenya without parliamentary approval?"], "77": ["What activities are restricted for full-time State officers?", "Can appointed State officers hold political party offices?", "How many concurrent remunerative positions can retired State officers hold in State-owned companies or organs?", "What is the limit on remunerative positions for retired State officers receiving pensions?", "What other remuneration can retired State officers receive besides what's mentioned in clause (3)?"], "78": ["Who is eligible for election or appointment to a State office in Kenya?", "Can a State officer or member of the defence forces hold dual citizenship?", "Are there any exceptions to the citizenship requirements for State officers and defence forces members?", "Who are exempt from these citizenship requirements?", "What happens if a person becomes a citizen of another country without their consent?"], "79": ["What body is responsible for enacting legislation to establish the ethics and anti-corruption commission?", "What is the status and powers of the commission?", "What is the purpose of the commission?", "What provisions does the commission ensure compliance with and enforce?", "What chapter does the commission fall under?"], "80": ["What procedures and mechanisms should Parliament establish for the effective administration of Chapter 6?", "What penalties, besides those in Article 75, can be imposed for violating this Chapter?", "How should this Chapter apply to public officers?", "What additional provisions should Parliament make to promote leadership and integrity principles and enforce this Chapter?", "What specific legislation should Parliament enact to ensure the principles of this Chapter are upheld?"], "81": ["How does the electoral system ensure freedom for citizens to exercise their political rights?", "What is the gender representation requirement for elective public bodies?", "How should persons with disabilities be represented in the electoral system?", "What is the principle of universal suffrage based on in the electoral system?", "What are the key aspects of free and fair elections as per the constitution?"], "82": ["What bodies are responsible for delimiting electoral units for national and county assembly elections?", "How does the constitution ensure voting is accessible to all citizens, including those with special needs?", "What is the process for registering citizens residing outside Kenya to vote?", "What are the key requirements for the conduct of elections and referenda as per the constitution?", "How does the constitution ensure the nomination process for candidates is regulated and supervised?"], "83": ["Who qualifies to register as a voter?", "Can a person be registered at multiple centers?", "What should administrative arrangements for voter registration and elections ensure?", "What are the requirements for a citizen to be registered as a voter?", "What happens if a person is convicted of an election offence within the last five years?"], "84": ["Who enforces the code of conduct for candidates and political parties in elections?", "What body is responsible for prescribing the code of conduct for elections?", "What should all candidates and political parties do in every election?", "Who ensures that candidates and political parties adhere to the code of conduct?", "What is the purpose of the code of conduct in elections?"], "85": ["Who can stand as an independent candidate without being a party member?", "What is the required time frame for not being a party member?", "What qualifications must an independent candidate for the National Assembly or Senate meet?", "What about for a county assembly?", "Are there different requirements for different levels of assembly?"], "86": ["What voting method should the IEBC ensure is used at every election?", "Who is responsible for counting, tabulating, and announcing votes at each polling station?", "Who is responsible for collating and announcing results from polling stations?", "What measures should the IEBC put in place to prevent electoral malpractice?", "How should election materials be secured?"], "87": ["How long does Parliament have to enact legislation for electoral dispute settlement?", "What is the timeframe for filing petitions regarding elections, excluding presidential ones?", "What are the methods for serving electoral petitions?", "What is the role of the Independent Electoral and Boundaries Commission in electoral disputes?", "What kind of newspaper is suitable for serving petitions by advertisement?"], "88": ["What bodies or offices does one need to have not held or stood for election from to be eligible for the Commission?", "What are the key responsibilities of the Independent Electoral and Boundaries Commission?", "What is the timeframe for ineligibility for appointment to the Commission if one has held a specific office or stood for election?", "What is the Commission not responsible for in terms of electoral disputes?", "What legislation must the Commission comply with while performing its functions?"], "89": ["How often must the IEBC review constituency boundaries?", "What factors can cause a constituency's population to differ from the quota?", "When do new boundaries take effect?", "Who can challenge the Commission's decisions on boundaries?", "How long does the court have to review the Commission's decisions?"], "90": ["How are seats in Parliament and county assemblies allocated to political parties?", "What is the role of the Independent Electoral and Boundaries Commission in these elections?", "What are the requirements for a party list in these elections?", "How does regional and ethnic diversity factor into party lists?", "How are seats allocated to political parties after the election?"], "91": ["What are the fundamental requirements for a political party in Kenya as per the constitution?", "What should a political party not do according to the constitution?", "What are the key principles a political party must uphold to promote democracy and unity?", "How should a political party ensure fairness and inclusivity in its operations?", "What are the prohibited activities for political parties in Kenya?"], "92": ["How does the constitution ensure fair media coverage for political parties?", "What restrictions does it place on the use of public resources for political parties?", "What are the roles and functions of political parties as per the constitution?", "How does the constitution regulate political parties and their broadcasts?", "What are the necessary management aspects of political parties outlined in the constitution?"], "93": ["What are the two houses that make up the Parliament of Kenya?", "How many houses does the Parliament of Kenya consist of?", "What is the name of the lower house of the Kenyan Parliament?", "What is the name of the upper house of the Kenyan Parliament?", "According to the Constitution, how many houses does the Kenyan Parliament have in total?"], "94": ["Who holds the legislative authority in Kenya at the national level?", "How does Parliament represent the will of the people?", "What can Parliament amend or alter according to the Constitution?", "What is Parliament's role in protecting the Constitution?", "Which body has the power to make laws in Kenya besides Parliament?"], "95": ["What does the National Assembly primarily represent?", "What are the key functions of the National Assembly in terms of deliberation?", "What is the role of the National Assembly in enacting legislation?", "How does the National Assembly manage national revenue and expenditure?", "What is the oversight role of the National Assembly regarding the President, Deputy President, and other State officers?"], "96": ["What does the Senate primarily represent and protect?", "How does the Senate contribute to law-making regarding counties?", "What is the Senate's role in distributing national revenue among counties?", "What kind of oversight does the Senate have over national revenue allocated to county governments?", "In which capacity does the Senate participate in the oversight of State officers?"], "97": ["How many members does the National Assembly consist of in total?", "How are the members of the National Assembly elected, and what are the different categories of members?", "What is the role of the Speaker in the National Assembly?", "How many women are specifically elected to the National Assembly?", "What special interests are represented by the nominated members of the National Assembly?"], "98": ["How many members are elected by county voters in the Senate?", "How many women members are nominated to the Senate?", "How are youth and persons with disabilities represented in the Senate?", "Who is an ex-officio member of the Senate?", "Can anyone contest an election under clause (1)(a)?"], "99": ["What are the basic qualifications for someone to be elected as a member of Parliament in Kenya?", "What are the specific educational, moral, and ethical requirements for a parliamentary candidate?", "How many registered voters' signatures are required for an independent candidate to run for the National Assembly?", "What are the grounds for disqualification from running for Parliament?", "Can a person be disqualified from running for Parliament if they have a pending appeal or review of a decision against them?"], "100": ["How does the constitution ensure women's representation in Parliament?", "What groups should Parliament prioritize for increased representation?", "How can Parliament promote youth representation?", "Which minorities should Parliament focus on for better representation?", "How does the constitution aim to include marginalized communities in Parliament?"], "101": ["How often are general elections for members of Parliament held?", "What happens when a vacancy occurs due to resignation or death of a member elected through a party list?", "How is a vacancy filled for a member elected through a party list?", "What is the process when a vacancy occurs for a member elected directly by the people?", "Are by-elections held if a general election is approaching?"], "102": ["How long does the term of each House of Parliament last?", "Under what circumstances can Parliament extend its term?", "By how much can Parliament extend its term at a time?", "For how long can Parliament extend its term in total?", "What majority is required in each House to pass a resolution extending Parliament's term?"], "103": ["What are the circumstances that lead to a member of Parliament losing their seat?", "How many consecutive sessions can a member miss without facing consequences?", "What happens if a member leaves their political party after being elected?", "What is the role of Parliament in legislating party resignations?", "What are the grounds for a member's automatic disqualification from Parliament?"], "104": ["Who has the right to recall a member of Parliament?", "When can a member of Parliament be recalled?", "What should Parliament legislate regarding recall?", "What are the grounds for recalling a member?", "What is the procedure for recalling a member?"], "105": ["Who determines if a person has been validly elected as a parliament member?", "What is the timeframe for resolving such disputes?", "What kind of legislation should Parliament enact regarding this Article?", "What happens if a parliament member's seat becomes vacant?", "Who hears and determines these questions?"], "106": ["How are Speakers and Deputy Speakers of Parliament elected?", "Who can be elected as Speaker or Deputy Speaker?", "When does the office of Speaker or Deputy Speaker become vacant?", "What happens if a new House of Parliament meets after an election?", "How can the office holder resign?"], "107": ["Who presides over a single House of Parliament when the Speaker is absent?", "Who presides over a single House of Parliament when both the Speaker and Deputy Speaker are absent?", "Who presides over a joint sitting of the Houses of Parliament?", "How is the presiding officer for a single House of Parliament in the absence of both the Speaker and Deputy Speaker elected?", "Who assists the Speaker of the National Assembly during a joint sitting of the Houses of Parliament?"], "108": ["How are the leaders of the majority and minority parties determined in the National Assembly?", "What is the order of precedence for these leaders in the National Assembly?", "Who is the leader of the majority party?", "Who is the leader of the minority party?", "How are these leaders' positions affected by changes in the largest or second largest party or coalition?"], "109": ["How does Parliament exercise its legislative power?", "Where can a Bill concerning county government originate from?", "What are the requirements for passing a Bill not concerning county government?", "How can a Bill concerning county government be passed?", "Who can introduce a Bill in Parliament and under what conditions?"], "110": ["What makes a bill specifically about county government?", "How are bills concerning county government categorized?", "Who decides if a bill is about county government and its category?", "What happens after one house of parliament passes such a bill?", "What's the final step before a bill concerning county government becomes law?"], "111": ["How does a special Bill concerning a county government proceed in Parliament?", "What is the required majority in the National Assembly to amend or veto a special Bill from the Senate?", "What happens if the National Assembly fails to pass a resolution to amend or veto a special Bill?", "Who refers the Bill to the President if the National Assembly's resolution fails?", "How long does the Speaker have to refer the Bill to the President?"], "112": ["What happens if one House passes a Bill concerning counties and the second House rejects it?", "How is a Bill concerning counties handled if the second House passes it in an amended form?", "After reconsideration, what occurs if the originating House passes the Bill as amended?", "What happens if the originating House rejects the Bill as amended after reconsideration?", "What is the timeframe for the Speaker to refer the Bill to the President for assent?"], "113": ["What happens when a Bill is referred to a mediation committee?", "How is the mediation committee formed?", "What is the role of the mediation committee once formed?", "What happens if the mediation committee agrees on a version of the Bill?", "What occurs if the mediation committee fails to agree or if a version is rejected by either House?"], "114": ["What are the specific matters that a money bill can deal with?", "Who decides if a motion is a money bill?", "What is the process if a motion is deemed a money bill?", "What is the definition of a 'money bill' in this context?", "What are the exceptions to what a money bill can deal with?"], "115": ["How long does the President have to act on a Bill after receiving it?", "How can the President respond to a Bill?", "What happens if Parliament amends a Bill based on the President's reservations?", "What vote is required for Parliament to pass a Bill a second time with or without amendments?", "What occurs if the President does not assent to or refer back a Bill within the prescribed time?"], "116": ["How long after assent is a Bill published as an Act?", "When does an Act of Parliament come into force?", "Under what condition does an Act not come into force immediately?", "What exception is there to clause (3)?", "When does clause (3) not apply?"], "117": ["What freedoms are guaranteed in Parliament regarding speech and debate?", "How can Parliament regulate its own business and that of its committees?", "What powers can Parliament grant to its leaders and committee chairs?", "What immunities do members of Parliament enjoy?", "How does Parliament ensure the orderly and effective discharge of its business?"], "118": ["How does Parliament ensure openness in its operations?", "What are the ways Parliament involves the public in its business?", "Under what conditions can the public or media be excluded from Parliament sittings?", "How does Parliament facilitate public participation in its legislative process?", "What role do committees play in public access and participation in Parliament's business?"], "119": ["Who can approach Parliament with a request?", "What can be petitioned to Parliament about?", "What should Parliament do regarding petitions?", "How does Parliament decide on petitions?", "What process does Parliament set for petitions?"], "120": ["What are the official languages of Parliament according to the Kenyan Constitution?", "In which languages can the business of Parliament be conducted?", "How is a conflict between different language versions of an Act of Parliament resolved?", "Which version of an Act of Parliament prevails in case of a conflict between different language versions?", "What role does the President play in resolving language conflicts in Acts of Parliament?"], "121": ["What is the minimum number of members required for the National Assembly to have a quorum?", "What is the quorum for the Senate?", "How does the quorum differ between the National Assembly and the Senate?", "What is the quorum for the National Assembly in simple terms?", "What is the quorum for the Senate in simple terms?"], "122": ["How is a decision made in Parliament when a vote is tied?", "What is the role of the Speaker during a vote in Parliament?", "When can a member of Parliament not vote on a question?", "How is the number of members counted for voting purposes in Parliament?", "What happens if the number of votes is equal in Parliament?"], "123": ["How are Senate members grouped for voting on matters affecting counties?", "Who leads a county's delegation in the Senate?", "How is a vote cast on behalf of a county delegation?", "What is the voting threshold for matters affecting counties?", "How does the Speaker determine if a matter affects counties?"], "124": ["What kind of committees can each House of Parliament establish?", "What is the purpose of Standing Orders in Parliament?", "How can Parliament regulate joint committees?", "What makes the proceedings of a House of Parliament valid?", "How are appointments requiring parliamentary approval processed?"], "125": ["What bodies in Parliament can summon individuals for evidence?", "What powers does Parliament have to enforce witness attendance?", "Can Parliament compel the production of documents?", "What is the process for examining witnesses abroad?", "What is the equivalent court power for Parliament in summoning witnesses?"], "126": ["Where can Parliament sit?", "When does a new House's first sitting occur?", "Who appoints the place and date for a new House's first sitting?", "How soon after election must the first sitting of a new House occur?", "Can sittings of either House start at any time?"], "127": ["Who chairs the Parliamentary Service Commission?", "How many members are in the Commission and how are they appointed?", "What happens to a member's position if they're no longer in Parliament?", "How long does a member's term last after a House's term ends?", "What are the main responsibilities of the Commission?"], "128": ["Who appoints the Clerk for each House of Parliament?", "What body approves the appointment of the Clerk?", "What is the role of the Parliamentary Service Commission in the appointment of the Clerk?", "Who are the staff of the Clerk?", "What is the status of the offices of the Clerks and their staff?"], "129": ["Who does executive authority derive from according to the Kenyan Constitution?", "How should executive authority be exercised according to the Constitution?", "What principle should guide the exercise of executive authority in Kenya?", "What is the primary goal of executive authority in Kenya?", "What should executive authority aim to achieve for the people of Kenya?"], "130": ["What are the key components of the national executive in Kenya?", "How should the national executive reflect the diversity of Kenya's population?", "What is the role of the Cabinet in the national executive?", "Who are the top two positions in the national executive?", "What is the purpose of reflecting regional and ethnic diversity in the national executive?"], "131": ["Who is the ultimate authority in Kenya's executive branch?", "What are the key roles of the President as per the Constitution?", "Who assists the President in exercising executive authority?", "What is the President's role in the military?", "What other offices can the President not hold?"], "132": ["What are the regular occasions when the President addresses Parliament?", "How does the President report on the progress of national values?", "Who does the President appoint with the approval of the National Assembly?", "What are the President's responsibilities in coordinating government functions?", "What additional executive functions can the President perform?"], "133": ["Who advises the President in exercising the power of mercy?", "What are the members of the Advisory Committee on the Power of Mercy?", "What should Parliament legislate for regarding the Advisory Committee?", "Can the Advisory Committee consider victims' views in its recommendations?", "Who cannot be a member of the Advisory Committee?"], "134": ["Who can temporarily exercise presidential powers?", "What powers can't be exercised during temporary incumbency?", "What are the specific powers mentioned in clause (2) that can't be exercised?", "When does temporary incumbency begin and end?", "What happens to these powers when the President is absent or incapacitated?"], "135": ["How are presidential decisions documented?", "What must a presidential decision include?", "What are the required elements of a presidential decision?", "What is the format of a presidential decision?", "What are the necessary components of a presidential decision?"], "136": ["How often is the President elected?", "When is the presidential election held?", "Who elects the President?", "What is the legal framework for presidential elections?", "What triggers a presidential election outside the regular schedule?"], "137": ["What are the citizenship and political party requirements for a presidential candidate?", "Can a public officer be a presidential candidate?", "Are there exceptions to the public officer disqualification?", "How many counties must support a presidential candidate's nomination?", "What is the voter threshold for presidential candidate nomination?"], "138": ["How is a president elected if only one candidate is nominated?", "What is the voting process for a presidential election?", "What are the requirements for a candidate to be declared elected as president?", "What happens if no candidate meets the election requirements?", "Under what circumstances is a presidential election cancelled and a new one held?"], "139": ["If a President-elect dies before assuming office, who takes over as acting President?", "How long after the President-elect's death is a fresh election held?", "If the Deputy President-elect dies before assuming office, what happens to their position?", "If both President and Deputy President-elect die before assuming office, who acts as President?", "In this case, how long is it before a fresh presidential election is held?"], "140": ["How long after the presidential election results are declared can a person file a petition challenging the President-elect's election?", "How long does the Supreme Court have to hear and decide a presidential election petition after it's filed?", "What happens if the Supreme Court rules the President-elect's election invalid?", "How soon after such a ruling must a fresh election be held?", "What is the final authority in deciding presidential election disputes, according to this article?"], "141": ["Who swears in the President-elect?", "When does the President-elect take the oath of office?", "What oaths does the President-elect take?", "What happens if a petition is filed under Article 140?", "Who decides the procedure and ceremony for the swearing-in of a President-elect?"], "142": ["How long does a President's term last?", "Can a President serve more than two terms?", "When does a President's term begin and end?", "What triggers the end of a President's term?", "What happens after a President's term ends?"], "143": ["Can the President face criminal charges during their term?", "Can civil cases be filed against the President during their tenure?", "Does holding the President's office pause legal time limits?", "Are there any exceptions to the President's immunity from legal proceedings?", "Can the President be prosecuted for crimes under international treaties?"], "144": ["How many members of the National Assembly are needed to initiate an investigation into the President's capacity to perform their duties?", "Who appoints the tribunal to investigate the President's capacity, and what are its members?", "What happens if the President is unable to nominate a person for the tribunal?", "How long does the tribunal have to report its findings?", "What is the final step in the process if the National Assembly votes to ratify the tribunal's report that the President is incapable of performing their duties?"], "145": ["How many members of the National Assembly are needed to initiate an impeachment motion against the President?", "What is the required majority in the National Assembly for an impeachment motion to proceed?", "Who informs the Senate about the impeachment resolution and within what timeframe?", "What is the role of the Senate in the impeachment process after receiving the resolution?", "What is the required majority in the Senate to uphold an impeachment charge and remove the President?"], "146": ["What happens if the President dies or resigns?", "Who takes over if the President's office becomes vacant?", "When does a new President have to be elected?", "How long does an acting President serve?", "Under what conditions does an acting President serve a full term?"], "147": ["What are the primary duties of the Deputy President?", "When can the Deputy President act as the President?", "What other roles can the Deputy President not hold?", "What functions can the President assign to the Deputy President?", "How does the Deputy President assist the President?"], "148": ["How is a Deputy President candidate nominated in a presidential election?", "Is there a separate nomination process for the Deputy President?", "Who swears in the Deputy President-elect?", "What are the terms of office for a Deputy President?", "Can a Deputy President resign from office and if so, how?"], "149": ["When a Deputy President's office becomes vacant, how long does the President have to nominate a replacement?", "How long does the National Assembly have to vote on the President's nomination?", "If a person becomes Deputy President after a vacancy, under what conditions are they considered to have served a full term?", "In what other cases is a person not considered to have served a term as Deputy President?", "What happens if a person assumes office as Deputy President under the given clause?"], "150": ["Under what circumstances can the Deputy President be removed from office?", "What are the grounds for impeaching the Deputy President?", "How does the process of removing the Deputy President differ from that of the President?", "What happens if the Deputy President is found physically or mentally incapable of performing their duties?", "What is the legal basis for removing the Deputy President from office?"], "151": ["How are the President's and Deputy President's salaries and benefits funded?", "Can their remuneration and benefits be reduced while they're in office?", "What happens to a former President's and Deputy President's retirement benefits and privileges?", "Can these benefits and privileges be reduced after they've left office?", "What are the lifetime guarantees for former Presidents and Deputy Presidents regarding their benefits and privileges?"], "152": ["Who are the members of the Cabinet according to the Constitution?", "How are Cabinet Secretaries appointed and by whom?", "Can a Cabinet Secretary also be a Member of Parliament?", "How can a Cabinet Secretary resign?", "What are the grounds for dismissing a Cabinet Secretary and who decides this?"], "153": ["How are Cabinet decisions recorded?", "Who do Cabinet Secretaries answer to for their actions?", "Can Cabinet Secretaries be summoned by Parliament?", "What guidelines must Cabinet Secretaries follow?", "How often and in what manner do Cabinet Secretaries report to Parliament?"], "154": ["Who establishes and appoints the Secretary to the Cabinet?", "How is the Secretary to the Cabinet dismissed?", "What are the main responsibilities of the Secretary to the Cabinet?", "Who directs the other functions of the Secretary to the Cabinet?", "How does the Secretary to the Cabinet resign from office?"], "155": ["Who establishes the office of Principal Secretary?", "What is the role of a Principal Secretary in a State department?", "Who nominates and appoints Principal Secretaries, and what is the approval process?", "Can the President reassign a Principal Secretary's role?", "How does a Principal Secretary resign from office?"], "156": ["How is the Attorney-General appointed?", "What are the qualifications for the Attorney-General?", "What are the primary roles of the Attorney-General?", "In what legal proceedings does the Attorney-General represent the national government?", "What additional powers does the Attorney-General have?"], "157": ["Who appoints the Director of Public Prosecutions and how is this done?", "What are the qualifications required for the appointment as Director of Public Prosecutions?", "What powers does the Director of Public Prosecutions have regarding criminal proceedings?", "Can the Director of Public Prosecutions discontinue criminal proceedings at any stage?", "Who can the Director of Public Prosecutions exercise powers through?"], "158": ["What are the grounds for removing the Director of Public Prosecutions?", "Who can initiate the process of removing the Director of Public Prosecutions?", "What role does the Public Service Commission play in this process?", "What is the composition of the tribunal that inquires into the matter?", "What happens to the remuneration of the Director of Public Prosecutions during suspension?"], "159": ["Who grants judicial authority and to whom does it vest?", "What principles guide the exercise of judicial authority?", "Which forms of dispute resolution are promoted?", "Under what conditions should traditional dispute resolution not be used?", "What should justice not be administered with undue regard to?"], "160": ["Who can control or direct the Judiciary in Kenya?", "Can a judge's office be abolished while they're in office?", "How is a judge's remuneration and benefits funded?", "Can a judge's remuneration or retirement benefits be reduced?", "Are judges immune from lawsuits for actions taken in their official capacity?"], "161": ["Who are the members of the Judiciary according to the article?", "What are the established offices in the Judiciary?", "Who heads the Judiciary?", "Who is the second-in-command in the Judiciary?", "What is the role of the Chief Registrar of the Judiciary?"], "162": ["What are the superior courts established by the constitution?", "What specific types of disputes can the courts established under clause (2) handle?", "Who decides the jurisdiction and functions of these courts?", "What are the subordinate courts mentioned in the article?", "How are the subordinate courts established?"], "163": ["Who are the members of the Supreme Court?", "What is the minimum number of judges required for the Supreme Court to be properly constituted?", "What are the types of jurisdiction the Supreme Court has?", "Under what conditions can appeals be made to the Supreme Court from the Court of Appeal?", "What is the role of the Supreme Court in providing advisory opinions?"], "164": ["How many judges are in the Court of Appeal?", "Who leads the Court of Appeal?", "What courts can appeal to the Court of Appeal?", "Can other courts or tribunals appeal to the Court of Appeal?", "How is the Court of Appeal organized and administered?"], "165": ["How many judges are in the High Court and how are they organized?", "Who elects the Principal Judge of the High Court?", "What are the key jurisdictions of the High Court?", "How many judges hear cases involving substantial questions of law?", "What types of cases does the High Court not have jurisdiction over?"], "166": ["Who appoints the Chief Justice and Deputy Chief Justice, and how is this done?", "What are the qualifications required for a person to be appointed as a judge of a superior court?", "What is the required experience for appointment as a judge of the Supreme Court?", "What are the experience requirements for a judge of the Court of Appeal?", "What are the qualifications needed for a High Court judge?"], "167": ["What is the maximum age limit for a judge to retire?", "How long can the Chief Justice serve in office?", "What happens if the Chief Justice's term expires before retirement age?", "Can a former Chief Justice remain on the Supreme Court after their term?", "How does a judge or the Chief Justice resign from office?"], "168": ["What are the grounds for removing a judge from a superior court?", "Who can initiate the process of removing a judge?", "What should a petition for removing a judge contain?", "What happens after the Judicial Service Commission receives a valid petition?", "How is the tribunal appointed to investigate the judge's conduct composed?"], "169": ["What are the different types of subordinate courts listed in the constitution?", "Who has the power to confer jurisdiction, functions, and powers on these courts?", "What kind of courts can be established by an Act of Parliament, besides those mentioned in Article 162(2)?", "What is the role of Parliament in relation to the subordinate courts?", "What are the specific courts mentioned in clause (1) of this article?"], "170": ["How many Kadhis are required by law?", "What are the qualifications to be a Kadhi?", "Who establishes Kadhis' courts and what powers do they have?", "How many Kadhis can hold a Kadhi's court?", "What kind of cases can a Kadhi's court handle?"], "171": ["Who are the members of the Judicial Service Commission?", "How long do the members serve?", "Who appoints the members representing the public?", "What is the role of the Chief Registrar of the Judiciary in the Commission?", "What is the maximum term length for a member of the Commission?"], "172": ["What are the key functions of the Judicial Service Commission?", "How does the Commission ensure the independence and accountability of the judiciary?", "What role does the Commission play in the appointment of judges and other judicial officers?", "How does the Commission handle complaints against registrars, magistrates, and other staff of the Judiciary?", "What steps does the Commission take to promote gender equality in the judiciary?"], "173": ["Who manages the Judiciary Fund?", "What are the primary uses of the Judiciary Fund?", "Who approves the annual expenditure estimates for the Judiciary?", "How is the Judiciary Fund financed after approval?", "What kind of legislation will Parliament enact regarding the Fund?"], "174": ["What are the primary goals of devolving government power in Kenya?", "How does devolution aim to foster unity while acknowledging diversity?", "In what ways does devolution empower local communities to manage their own affairs and participate in decision-making?", "How does the constitution protect the interests and rights of minorities and marginalized communities through devolution?", "What are the key services and resources that devolution aims to distribute equitably across Kenya?"], "175": ["What are the key principles on which county governments should be based?", "How should county governments ensure financial sustainability?", "What is the gender representation requirement for county government members?", "What is the maximum proportion of members of the same gender allowed in county representative bodies?", "How does the separation of powers apply to county governments?"], "176": ["What are the two main components of a county government?", "How should county governments handle their functions and services?", "What is the primary goal of decentralizing county functions and services?", "What factors determine the extent to which county functions and services should be decentralized?", "What is the purpose of having a county government for each county?"], "177": ["How often are county assemblies elected and on what day?", "What is the gender balance requirement for county assembly members?", "Who determines the number of members from marginalised groups?", "When are special seats under clause (1)(b) filled?", "What is the term length of a county assembly?"], "178": ["Who elects the speaker of a county assembly?", "How is a county assembly sitting presided over in the speaker's absence?", "What legislative process is responsible for the election and removal of county assembly speakers?", "Can a non-member of the county assembly become its speaker?", "Who can preside over a county assembly sitting when the speaker is absent?"], "179": ["Who are the members of the county executive committee?", "How many members can be appointed to the committee?", "What are the roles of the county governor and deputy county governor?", "Who acts as county governor when the governor is absent?", "What happens to appointed members when the governor's office becomes vacant?"], "180": ["How often are county governors elected?", "What are the eligibility criteria for a county governor?", "What happens if only one candidate is nominated for county governor?", "How is the deputy county governor elected?", "What are the term limits for county governors and deputy county governors?"], "181": ["What are the grounds for removing a county governor from office?", "Who enacts the legislation for the removal procedure?", "What should the legislation cover regarding removal grounds?", "What happens if a county governor is physically or mentally unable to perform their duties?", "What is the process for removing a county governor based on the given grounds?"], "182": ["What happens if the county governor dies or resigns?", "Who takes over if both the county governor and deputy are unable to serve?", "When is a new election held if the speaker acts as governor?", "How long does a person acting as governor serve?", "What are the conditions for a county governor's office to become vacant?"], "183": ["What are the primary tasks of a county executive committee?", "Can a county executive committee propose legislation?", "What is the role of a county executive committee in managing county administration?", "What kind of functions can be assigned to a county executive committee beyond those listed?", "How often and about what should the county executive committee report to the county assembly?"], "184": ["How are urban areas and cities classified in Kenya's constitution?", "What are the key principles for governing and managing urban areas and cities according to the constitution?", "How does the constitution ensure resident participation in urban area governance?", "Can the constitution differentiate between types of urban areas and cities for governance purposes?", "What mechanisms does the constitution suggest for identifying and governing different categories of urban areas and cities?"], "185": ["Who has the power to make laws for a county?", "What kind of laws can a county assembly make?", "What role does a county assembly play in overseeing the county executive?", "What plans and policies can a county assembly approve?", "How does a county assembly respect the separation of powers principle?"], "186": ["What are the primary functions and powers of the national and county governments according to the Constitution?", "What happens when a function or power is given to more than one level of government?", "If a function or power isn't assigned to a county, who has the authority over it?", "Can Parliament legislate for the Republic on any matter, even if not explicitly stated in the Constitution?", "What happens if a function or power isn't explicitly assigned by the Constitution or national legislation to a county?"], "187": ["Under what conditions can a function or power be transferred between levels of government?", "Who decides if a function or power is more effectively performed by another level of government?", "What resources must be transferred when a function or power is shifted between levels?", "Which level of government remains constitutionally responsible for a transferred function or power?", "Can a function or power be transferred if it's prohibited by its original legislation?"], "188": ["How are county boundaries altered?", "What bodies must approve such alterations?", "What factors are considered when altering county boundaries?", "What is the minimum support required in the National Assembly for such alterations?", "What is the minimum support required in the Senate for such alterations?"], "189": ["How should governments at different levels cooperate and assist each other?", "What are the key aspects of their liaison and information exchange?", "How can they work together to enhance capacity?", "What steps should be taken in case of disputes between governments?", "What alternative dispute resolution mechanisms should be used for inter-governmental disputes?"], "190": ["What kind of support must Parliament ensure for county governments to perform their functions?", "What financial management system requirements must county governments comply with?", "Under what circumstances can the national government intervene in county governments?", "What actions can the national government take during intervention?", "What process is there for ending national government intervention?"], "191": ["When does national legislation take precedence over county legislation?", "Under what conditions does county legislation prevail over national legislation?", "What happens when there's an apparent conflict between legislations of different levels of government?", "How can courts interpret conflicting legislations to avoid conflict?", "What is the effect of a court decision that one level of government's provision prevails over another's?"], "192": ["Under what circumstances can the President suspend a county government?", "What process must be followed before a county government can be suspended for exceptional circumstances?", "Who performs the functions of a county government during a suspension?", "Which body can end a suspension at any time?", "How long can a suspension under this article last?"], "193": ["What are the basic qualifications for a person to be elected as a member of a county assembly?", "What are the specific disqualifications for a person to be elected as a member of a county assembly?", "How long must a person have been a citizen of Kenya to be eligible for election as a member of a county assembly?", "What is the minimum imprisonment sentence that disqualifies a person from being elected as a member of a county assembly?", "What is the process for a disqualification under clause (2) to be considered final?"], "194": ["What are the circumstances under which a member of a county assembly's office becomes vacant?", "How many sittings can a member miss without permission?", "What happens if a member resigns from their political party?", "Can a member who was elected independently join a political party?", "What are the grounds for disqualification for a member of a county assembly?"], "195": ["Who can be summoned by a county assembly or its committee?", "What powers does an assembly have to enforce witness attendance?", "Can an assembly compel the production of documents?", "What is the process for examining witnesses abroad?", "What is the purpose of summoning witnesses or providing information?"], "196": ["How does the county assembly ensure transparency in its operations?", "What are the circumstances under which the public can be excluded from assembly sittings?", "How is public participation facilitated in the county assembly's business?", "What role does the speaker play in determining public exclusion from sittings?", "What kind of legislation will Parliament enact regarding county assembly powers and privileges?"], "197": ["What is the maximum gender ratio for county assembly and executive committee members?", "How should cultural diversity be reflected in county assemblies and executives?", "What legislative measures are required to ensure diversity in county governance?", "How should minorities be protected within counties?", "What is the purpose of the two-thirds gender rule in county assemblies and executives?"], "198": ["What happens to the county executive committee during a county assembly election?", "Who performs administrative functions during this period?", "How long does this interim period last?", "When is a new executive committee constituted?", "What are the duties of the interim executive committee?"], "199": ["What makes county legislation legally effective?", "Can other laws dictate county legislation's publication requirements?", "What happens if county legislation isn't published in the Gazette?", "What are the basic publication rules for county legislation?", "Can national laws influence how county legislation is published?"], "200": ["What kind of legislation should Parliament enact to support Chapter 11?", "What specific areas should this legislation cover regarding city governance?", "How can functions and powers be transferred between different levels of government?", "What are the processes for electing or appointing officials in county governments?", "Under what circumstances can county assemblies or executive committees be suspended?"], "201": ["How is openness and accountability ensured in public finance?", "How is the burden of taxation shared fairly?", "How is national revenue shared between national and county governments?", "How does expenditure promote equitable development?", "How is the use of resources and public borrowing shared between generations?"], "202": ["How is national revenue shared between national and county governments?", "Can county governments receive extra allocations from the national government's share?", "Under what conditions can county governments receive additional allocations?", "Are there any unconditional additional allocations for county governments?", "How does the constitution ensure equitable revenue sharing?"], "203": ["What criteria are considered when determining the equitable shares for county governments?", "What is the minimum percentage of national revenue that must be allocated to county governments each year?", "How is the amount allocated to county governments calculated?", "What is the purpose of the flexibility mentioned in clause (k) of the article?", "How often is the equitable share recalculated?"], "204": ["What percentage of national revenue goes into the Equalisation Fund annually?", "What specific services are prioritized for funding from the Equalisation Fund?", "How is the use of the Equalisation Fund approved and distributed?", "Which body is consulted before Parliament appropriates funds from the Equalisation Fund?", "What happens to unspent funds in the Equalisation Fund at the end of a financial year?"], "205": ["When does the Commission on Revenue Allocation review financial legislation affecting counties?", "What happens after the Commission reviews the financial legislation?", "How are the Commission's recommendations handled in Parliament?", "Before voting on the Bill, what does each House of Parliament do with the Commission's recommendations?", "What is the final step for the Houses of Parliament regarding the Bill after considering the Commission's recommendations?"], "206": ["What funds are excluded from the Consolidated Fund?", "How can money be withdrawn from the Consolidated Fund?", "What is the role of the Controller of Budget in fund withdrawal?", "What is the requirement for withdrawing money from other national public funds?", "What happens if money is withdrawn from the Consolidated Fund without approval?"], "207": ["What funds are established for each county government according to this article?", "How can money be withdrawn from a county's Revenue Fund?", "Who approves the withdrawal of money from a county's Revenue Fund?", "What additional provisions can Parliament make for withdrawing funds from a county's Revenue Fund?", "What other funds can counties establish and manage, according to this article?"], "208": ["What is the purpose of the Contingencies Fund in Kenya's constitution?", "Who is responsible for managing the Contingencies Fund?", "Under what circumstances can funds be advanced from the Contingencies Fund?", "What is the legislative process for operating the Contingencies Fund?", "What happens if there's no other authority for expenditure but it's urgent and unforeseen?"], "209": ["Who can impose income tax, value-added tax, customs duties, and excise tax?", "Can counties impose any tax other than those listed for them?", "What taxes can counties impose without parliamentary authorization?", "Which governments can impose charges for services?", "Under what conditions can counties exercise their taxation powers?"], "210": ["How can taxes or licensing fees be imposed, changed, or waived?", "What records must be kept and reported when a tax or licensing fee is waived?", "Can state officers be exempt from paying taxes due to their office or work nature?", "What information must be maintained and reported to the Auditor-General regarding tax waivers?", "What are the conditions under which state officers cannot be exempt from paying taxes?"], "211": ["What bodies can legislate terms for national government borrowing?", "Who is responsible for presenting loan information to Parliament?", "What details must be provided about a loan when requested by Parliament?", "How soon after a request must loan information be presented?", "What is the maximum time frame for loan repayment information to be provided?"], "212": ["Under what conditions can a county government borrow?", "What role does the national government play in county borrowing?", "What approval is required for a county to borrow?", "Can a county borrow without the national government's guarantee?", "What body within the county must approve borrowing?"], "213": ["What authorizes the national government to guarantee loans?", "What are the conditions for loan guarantees by the national government?", "How often is a report on loan guarantees published?", "When is the report on loan guarantees due after the end of a financial year?", "What should the report on loan guarantees include?"], "214": ["What is the primary fund that the public debt is charged to?", "Can the public debt be charged to other public funds?", "What constitutes the public debt according to this article?", "What financial obligations are considered part of the public debt?", "What are the sources of the public debt according to this article?"], "215": ["Who establishes the Commission on Revenue Allocation?", "How many members does the Commission consist of?", "Who appoints the Commission's members?", "Who cannot be members of the Commission?", "What professional experience is required for members under clauses (2)(a), (b), and (c)?"], "216": ["What is the primary role of the Commission on Revenue Allocation?", "How does the Commission allocate revenue between national and county governments?", "What additional responsibilities does the Commission have besides revenue allocation?", "What factors should the Commission consider while formulating recommendations?", "Who are the recipients of the Commission's recommendations?"], "217": ["How often does the Senate determine the basis for county revenue allocation?", "What criteria and consultations are involved in this determination?", "What is the role of the National Assembly in the process?", "What happens if the National Assembly doesn't vote on the resolution within 60 days?", "Can the Senate amend an approved resolution, and if so, under what conditions?"], "218": ["When is the Division of Revenue Bill introduced in Parliament?", "What does the Division of Revenue Bill divide?", "What is the purpose of the County Allocation of Revenue Bill?", "What should the memorandum accompanying each Bill include?", "What criteria is the Bill evaluated against?"], "219": ["When is a county's share of national revenue transferred?", "What happens to a county's share if transfer is stopped under Article 225?", "Can any deductions be made from a county's revenue share?", "When should the revenue share be transferred?", "What prevents the revenue from being transferred?"], "220": ["What should be included in the budgets of national and county governments?", "How should revenue and expenditure be differentiated in these budgets?", "How should anticipated deficits be addressed in these budgets?", "What forms of public liability can increase public debt and should be included in the budgets?", "What does national legislation dictate regarding the structure of county development plans and budgets?"], "221": ["When are budget estimates for the national government submitted to the National Assembly?", "What should the budget estimates include and how should they be presented?", "Which bodies' estimates are considered alongside the national government's by the National Assembly?", "What process does the National Assembly follow before considering the budget estimates?", "What happens after the National Assembly approves the estimates of national government expenditure?"], "222": ["When can the National Assembly authorize spending from the Consolidated Fund before the Appropriation Act is passed?", "What is the maximum amount that can be withdrawn for expenditure?", "What are the conditions for the money withdrawn under clause (1)?", "How is the money withdrawn under clause (1) to be accounted for in the Appropriation Act?", "What happens if the Appropriation Act is not likely to be assented to by the beginning of the financial year?"], "223": ["Under what conditions can the national government spend money not already appropriated?", "How soon must Parliament approve such spending?", "What happens if Parliament is not in session when approval is needed?", "After approval, what is the next step for the spent money?", "What is the maximum percentage of unappropriated spending allowed in a financial year?"], "224": ["Who passes the Division of Revenue Bill that county governments base their budgets on?", "What is the form and procedure for county budget and appropriation bills?", "What kind of Act of Parliament prescribes the form and procedure for county budgets?", "What is the timeline for county governments to prepare and adopt their annual budgets?", "What is the relationship between the Division of Revenue Bill and county budgets?"], "225": ["What bodies are responsible for financial control according to this article?", "Under what conditions can funds be stopped from being transferred?", "How long can funds be stopped from being transferred?", "What role does Parliament play in approving or renewing a decision to stop funds?", "What are the requirements before Parliament can approve or renew a decision to stop funds?"], "226": ["What bodies are responsible for auditing public entity accounts?", "Who is accountable for financial management in national and county public entities?", "Who audits the Auditor-General's office?", "What happens if a public official misuses public funds?", "What law governs the keeping of financial records and auditing of public accounts?"], "227": ["How are public contracts for goods and services awarded?", "What policies can Parliament set for procurement and asset disposal?", "What preferences can be given in allocating contracts?", "What actions can be taken against contractors who don't meet standards or agreements?", "What penalties can be imposed on those who default on taxes or engage in corruption or unfair employment practices?"], "228": ["How is the Controller of Budget appointed?", "What are the qualifications to be the Controller?", "How long does the Controller serve?", "What are the Controller's main responsibilities?", "How often does the Controller report to Parliament?"], "229": ["How is the Auditor-General appointed?", "What are the qualifications required to be the Auditor-General?", "How long does the Auditor-General serve and can they be re-appointed?", "What entities does the Auditor-General audit annually?", "What is the timeline for the Auditor-General's audit reports and their consideration by Parliament or county assemblies?"], "230": ["Who establishes the Salaries and Remuneration Commission?", "What are the members of the Salaries and Remuneration Commission?", "Who are the non-voting members of the Commission?", "What are the main functions of the Salaries and Remuneration Commission?", "What principles guide the Commission in performing its functions?"], "231": ["What is the primary institution established by this article?", "What are the key responsibilities of the Central Bank of Kenya?", "Who has control over the Central Bank of Kenya in its operations?", "What are the design restrictions for Kenyan currency?", "What will a future Act of Parliament provide for regarding the Central Bank of Kenya?"], "232": ["What are the key values and principles that guide public service in Kenya?", "How should public servants use resources and provide services?", "What role do citizens play in policy making according to the constitution?", "Who is accountable for administrative acts in the public service?", "How should appointments and promotions in the public service be based on?"], "233": ["Who establishes the Public Service Commission?", "How many members are in the Public Service Commission and how are they appointed?", "What are the eligibility criteria for members of the Public Service Commission?", "When do clauses (3)(c) and (3)(d) cease to apply to a person?", "Who is the chief executive of the Public Service Commission and how are they appointed?"], "234": ["What are the primary functions and powers of the Public Service Commission?", "Which offices in the public service are exempt from the Commission's jurisdiction?", "What is the role of the Commission in promoting certain values and principles within the public service?", "How does the Commission ensure the efficiency and effectiveness of the public service?", "Can the Commission delegate its functions and powers, and if so, to whom?"], "235": ["Who is responsible for establishing and abolishing offices in a county's public service?", "Who appoints and confirms appointments to these offices?", "Who exercises disciplinary control and removes individuals from these offices?", "What is the exception to the application of clause (1) in terms of offices or positions?", "What commission is not subject to the control of county governments as per this article?"], "236": ["What safeguards does the constitution provide for public officers against unfair treatment?", "How is a public officer protected from discrimination while performing their duties?", "What happens if a public officer is dismissed without proper legal process?", "Can a public officer be demoted without following the correct procedure?", "What is the constitution's stance on disciplinary action against public officers without due process?"], "237": ["What is the body established by Article 237?", "What are the key functions of the Teachers Service Commission?", "What powers does the Commission have over teachers' employment and discipline?", "What are the Commission's responsibilities regarding teacher education and demand?", "What role does the Commission play in advising the national government?"], "238": ["What are the internal and external threats that Kenya's national security aims to protect against?", "How is national security subject to the authority of the Constitution and Parliament?", "How should national security be pursued to respect the rule of law, democracy, and human rights?", "How should national security organs respect the diverse cultures of Kenyan communities?", "How should recruitment in national security organs reflect the diversity of the Kenyan people?"], "239": ["What are the main national security organs outlined in this article?", "What is the primary objective of these national security organs and the security system?", "What actions are prohibited for national security organs and their members?", "What is prohibited regarding the establishment of military or similar organizations?", "Who has the ultimate authority over the national security organs?"], "240": ["Who are the members of the National Security Council?", "What is the role of the National Security Council in national security?", "Who presides over the meetings of the National Security Council?", "What is the annual report of the National Security Council to Parliament about?", "Under what conditions can the National Security Council deploy or approve foreign forces?"], "241": ["What are the three branches of the Kenya Defence Forces?", "What are the responsibilities of the Kenya Defence Forces in emergency situations?", "Under what condition can the Kenya Defence Forces be deployed to restore peace?", "How should the command of the Kenya Defence Forces be composed?", "What are the members of the Defence Council and their roles?"], "242": ["What is the name of the service established in this article?", "What are the primary responsibilities of this service?", "What additional functions can this service perform?", "How are these additional functions determined?", "What is the overarching goal of this service's responsibilities?"], "243": ["What is the name of the service established in Article 243?", "What are the two services that make up the National Police Service?", "How does the National Police Service function throughout Kenya?", "What kind of legislation will Parliament enact to support Article 243?", "What is the purpose of the legislation that Parliament will enact for Article 243?"], "244": ["What are the primary objectives of the National Police Service in Kenya?", "How does the National Police Service ensure high standards of professionalism and discipline among its members?", "What measures does the National Police Service take to prevent corruption and promote transparency and accountability?", "How does the National Police Service ensure its staff respects human rights and fundamental freedoms?", "How does the National Police Service engage with and foster relationships with the broader society?"], "245": ["Who appoints the Inspector-General of the National Police Service and what is the required approval?", "What functions does the Inspector-General independently command over the National Police Service?", "Who heads the Kenya Police Service and the Administration Police Service, and how are they appointed?", "Under what conditions can the Cabinet Secretary give directions to the Inspector-General?", "What are the grounds for removing the Inspector-General from office?"], "246": ["Who establishes the National Police Service Commission?", "What are the roles of the President in appointing the Commission's members?", "What are the key responsibilities of the National Police Service Commission?", "Who are the members of the Commission, besides the President's appointees?", "How should the composition of the National Police Service reflect Kenya's diversity?"], "247": ["Can Parliament create other police services?", "Who supervises these services?", "Who commands these services?", "Are these services under the National Police Service?", "Can these services be established by legislation?"], "248": ["Which commissions are covered by this Chapter?", "What are the independent offices mentioned in this Chapter?", "To which commissions and offices does this Chapter not apply?", "What is the exception to this Chapter's application?", "What are the specific commissions and offices listed in this Chapter?"], "249": ["What are the primary objectives of the commissions and independent offices as per the constitution?", "Who or what are the commissions and independent offices subject to, according to the article?", "What is the independence of these bodies from, as per the constitution?", "How does the constitution ensure adequate funding for these bodies?", "How is the budget for each commission and independent office structured?"], "250": ["How many members can a commission have?", "What are the steps for appointing a commission member?", "What term length is a commission member eligible for?", "Can a commission member hold another job?", "How is a vice-chairperson elected?"], "251": ["Under what circumstances can a member of a commission or holder of an independent office be removed from their position?", "Who can initiate the process of removing such an individual and how?", "What are the steps the President must take upon receiving a petition for removal?", "What is the composition of the tribunal that investigates the matter?", "What are the entitlements of a person suspended during this process?"], "252": ["What triggers an investigation by a commission or independent office holder?", "What powers do these bodies have for dispute resolution?", "Who can make a complaint to these bodies?", "Which specific commissions and independent offices have the power to issue summons for investigations?", "What additional functions and powers can these bodies have, besides those outlined in the Constitution?"], "253": ["What is the legal status of commissions and independent offices in Kenya?", "How are these bodies recognized in law?", "What is the significance of them being bodies corporate?", "Can these bodies sue or be sued in their own name?", "What is the implication of their perpetual succession?"], "254": ["When do commissions and independent offices submit their annual reports?", "Who can request a report from these bodies at any time?", "What happens after a report is submitted under this Article?", "What is the timeline for submitting annual reports?", "Who are the recipients of these annual reports?"], "255": ["What are the specific matters that require a referendum for constitutional amendment?", "What is the voting threshold for a referendum on constitutional amendment?", "How is the voting threshold calculated for a referendum on constitutional amendment?", "What are the two ways to enact an amendment that doesn't relate to the specified matters?", "What is the process for enacting an amendment that doesn't relate to the specified matters through Parliament?"], "256": ["How can a Bill to amend the Constitution be introduced in Parliament?", "What restrictions are there on the content of an amendment Bill?", "What is the timeline for an amendment Bill to be called for second reading?", "What is the passing requirement for an amendment Bill in both Houses of Parliament?", "Under what conditions must the President request a national referendum before assenting to an amendment Bill?"], "257": ["How many registered voters are needed to propose an amendment via popular initiative?", "What are the two forms a popular initiative can take?", "Who verifies the signatures and submits the draft Bill to county assemblies?", "What is the deadline for county assemblies to consider the draft Bill?", "What happens if a majority of county assemblies approve the draft Bill?"], "258": ["Who can initiate legal action claiming this Constitution has been violated or is at risk of being violated?", "Can someone act on behalf of another person who can't act for themselves in such cases?", "Can a person act in the interest of a group or class of persons in these circumstances?", "Is it possible for someone to act in the public interest in this regard?", "Can an association act on behalf of one or more of its members in such cases?"], "259": ["How should the Constitution be interpreted to promote its purposes, values, and principles?", "How does the Constitution advance the rule of law and human rights?", "What does it mean for the law to be always speaking in the context of the Constitution?", "How are different language versions of the Constitution handled in case of a conflict?", "How is time calculated for various purposes under the Constitution?"], "260": ["What age defines an adult according to the constitution?", "Can you explain what 'affirmative action' means in the context of the constitution?", "How is 'disability' defined in the constitution?", "What are the different forms of 'document' recognized by the constitution?", "What is the initial financial year for any entity as per the constitution?"], "261": ["What is the timeframe for Parliament to enact legislation required by the Constitution?", "Can Parliament extend the timeframe for enacting legislation, and if so, under what conditions?", "Who is responsible for preparing the relevant Bills for tabling before Parliament?", "What happens if Parliament fails to enact legislation within the specified time?", "What are the consequences if the new Parliament also fails to enact the required legislation?"], "262": ["What date do the transitional and consequential provisions in the Sixth Schedule come into effect?", "What are the transitional and consequential provisions that are mentioned in this article?", "Where can I find these transitional and consequential provisions?", "What is the purpose of these provisions?", "What happens on the effective date according to this article?"], "263": ["When does the Kenyan Constitution come into force?", "What triggers the effective date of the Constitution?", "How is the effective date determined?", "What role does the President play in the Constitution's commencement?", "What is the maximum waiting period for the Constitution to come into force after the referendum result is published?"], "264": ["What was the previous constitution that was in force before the current one?", "When did the previous constitution cease to be in effect?", "What happened to the previous constitution on the effective date of the current one?", "What is the Sixth Schedule in relation to the repeal of the previous constitution?", "Are there any exceptions to the repeal of the previous constitution as stated in the Sixth Schedule?"]}